[
    "Zooming into the weekend at lightning ⚡️ speed. #terriertown [📸 credit: @rmedinafoto on Instagram] https://t.co/vaGLTeYLxG",
    "#ICYMI: 2020 is a leap year. — We know what you’re thinking: “Thanks, Captain Obvious.” — But there’s more to this random extra day than you might think. To help explain, we chatted with @AstronomyatBU’s JJ Hermes who breaks down why leap year is so important to our calendars. 📆 https://t.co/QQFC8hOtpk",
    "With spring break around the corner, and many BU students abroad. University officials have been in frequent contact with the students, families, and partner institutions in regard to travel plans, and any needs that arise because of the #coronavirus. https://t.co/oM2lGcjLHB",
    "Jennifer Childs-Roshak (Questrom’10), the first physician to lead Planned Parenthood in Massachusetts, talked about her interest in women’s health, her concerns about the future of Roe v. Wade, and why she is urging every eligible voter to vote in 2020. https://t.co/BIRyY9aBPu",
    "As the #coronavirus outbreak continues to spread worldwide, we launched a website for the BU community to find information and guidance regarding the University’s readiness. https://t.co/06LxuaBjp1",
    "200,000 works. 6,000 years of history. One collection.\n\nChristina Yu Yu (GRS'04) takes on one of the most important jobs in the museum world at the @mfaboston.\nhttps://t.co/ZbFGG3YiKk https://t.co/pNVnS8EEKx",
    "For #SuperTuesday, we wanted to know which issues matter most to our Terriers. We asked some of our students for their insights as they decide who to support in the 2020 presidential primaries: https://t.co/fDnS8GxSiv",
    "Racing to stop #coronavirus spread, BU @neidl scientists joined an international collaboration that will focus scientific efforts on understanding, detecting, treating, and preventing this #infectiousdisease: https://t.co/ArPSfLkPuM",
    "Terriers, meet Beacon Hill. — Beacon Hill, meet our Terriers. We think you'll get along just great. 🤝 https://t.co/sUmMnrDfYm",
    "While he might not be in China, Shisong Chen (@BU_Law’15,’20) wasn't going to let that stop him from helping. Chen and a few fellow law students are gathering supplies to send back to China to help fight #Coronavirus. https://t.co/gfNqZ8uABV",
    "What’s BU’s contingency plan if there’s a confirmed #coronavirus case on campus? Emergency Management director Rene Fielding on what the University is doing in the event of a campus emergency: https://t.co/V9zTL9aQb0",
    "No more last-minute dinner stress. #DineOutBoston is back.\n\nThe 12-day event brings prix-fixe menus across Boston so you can discover a new favorite.\n\nhttps://t.co/Tfo8bwKSVa",
    "RT @BUexperts: How is #coronavirus actually spreading? \nWhat are the symptoms? \nWhat should you do if you develop these symptoms? \n@neidl d…",
    "Just a few more days until a well-deserved break, Terriers. Keep up the hard work! 🙌 https://t.co/iCWfbOYncY",
    "Due to the spread of the #coronavirus, @BUCSC has suspended out-of-state #BUASB trips and will offer those who registered the opportunity to volunteer with local Boston area nonprofits: https://t.co/F7BusHYtAw",
    "Sunny days on Comm. Ave are almost back. ☀️ https://t.co/7RnaI7qf3D",
    "#ICYMI: @InnovateBU's Innovation Week is April 10 – 19, 2020. Don't miss this week dedicated to recognizing and celebrating novel ideas and endeavors across BU's campus and community.\n\nDetails ➡️ https://t.co/FTYoBM2Duy https://t.co/qpZqtqyHda",
    "Terriers, meet Brighton. — Brighton, meet our Terriers. We think you'll get along great. 🤝 https://t.co/Caeqy18NrR",
    "Happy Friday, Terriers! We wish you all a safe and restful break. ⛱️ https://t.co/qOtEt1Hu0E",
    "Staying in Boston this spring break? Don’t worry, we got you covered. Here's a list of some of the best things to do in Boston over the break. https://t.co/3hrrA1PSa2"
]